# LoadEffectApi

All URIs are relative to *http://localhost*

Method | Description
------------- | -------------
**add_load_effect** | Adds a new load effect to the connection.
**calculate_load_extremes** | Calculates load extremes for the connection and keeps only the critical load effects active.
**delete_load_effect** | Delete load effect loadEffectId.
**get_load_effect** | Gets load impulses from the specified load effect.
**get_load_effects** | Gets all load effects defined in the specified connection.
**get_load_settings** | Get Load settings for connection in project.
**set_load_settings** | Set Load settings for connection in project.
**update_load_effect** | Update load impulses in conLoading.

<a id="add_load_effect"></a>
# **add_load_effect**
> ConLoadEffect add_load_effect(project_id, connection_id, con_load_effect=con_load_effect)

Adds a new load effect to the connection.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project. |
 **connection_id** | **int**| The ID of the connection. |
 **con_load_effect** | **ConLoadEffect**| The load effect data to add. | [optional]

### Return type

**ConLoadEffect**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.models.con_load_effect import ConLoadEffect
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def add_load_effectExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project.
    connection_id = 56 # int | The ID of the connection.
    con_load_effect = ideastatica_connection_api.ConLoadEffect() # ConLoadEffect | The load effect data to add. (optional)

    try:
        # Adds a new load effect to the connection.
        api_response = api_client.loadeffect.add_load_effect(project_id, connection_id, con_load_effect=con_load_effect)
        print("The response of LoadEffectApi->add_load_effect:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling LoadEffectApi->add_load_effect: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **POST** /api/5/projects/{projectId}/connections/{connectionId}/load-effects

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: application/json
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**422** | Unprocessable Content |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="calculate_load_extremes"></a>
# **calculate_load_extremes**
> List[ConLoadEffect] calculate_load_extremes(project_id, connection_id)

Calculates load extremes for the connection and keeps only the critical load effects active.

Runs the load extremes (LEX) algorithm using the project's load extremes settings, then  deactivates every load effect that does not produce any extreme. Use this to reduce the number  of load effects calculated by `Calculate` on connections that contain many load effects.  The returned list contains all load effects with their updated !:ConLoadEffect.Active flag.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project. |
 **connection_id** | **int**| The ID of the connection. |

### Return type

[**List[ConLoadEffect]**](ConLoadEffect.md)

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.models.con_load_effect import ConLoadEffect
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def calculate_load_extremesExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project.
    connection_id = 56 # int | The ID of the connection.

    try:
        # Calculates load extremes for the connection and keeps only the critical load effects active.
        api_response = api_client.loadeffect.calculate_load_extremes(project_id, connection_id)
        print("The response of LoadEffectApi->calculate_load_extremes:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling LoadEffectApi->calculate_load_extremes: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **POST** /api/5/projects/{projectId}/connections/{connectionId}/load-effects/calculate-load-extremes

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="delete_load_effect"></a>
# **delete_load_effect**
> int delete_load_effect(project_id, connection_id, load_effect_id)

Delete load effect loadEffectId.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project. |
 **connection_id** | **int**| The ID of the connection. |
 **load_effect_id** | **int**| The ID of the load effect to delete. |

### Return type

**int**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def delete_load_effectExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project.
    connection_id = 56 # int | The ID of the connection.
    load_effect_id = 56 # int | The ID of the load effect to delete.

    try:
        # Delete load effect loadEffectId.
        api_response = api_client.loadeffect.delete_load_effect(project_id, connection_id, load_effect_id)
        print("The response of LoadEffectApi->delete_load_effect:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling LoadEffectApi->delete_load_effect: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **DELETE** /api/5/projects/{projectId}/connections/{connectionId}/load-effects/{loadEffectId}

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="get_load_effect"></a>
# **get_load_effect**
> ConLoadEffect get_load_effect(project_id, connection_id, load_effect_id, is_percentage=is_percentage)

Gets load impulses from the specified load effect.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project. |
 **connection_id** | **int**| The ID of the connection. |
 **load_effect_id** | **int**| The ID of the load effect to retrieve. |
 **is_percentage** | **bool**| Optional flag indicating whether to return percentage-based load effects. | [optional]

### Return type

**ConLoadEffect**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.models.con_load_effect import ConLoadEffect
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def get_load_effectExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project.
    connection_id = 56 # int | The ID of the connection.
    load_effect_id = 56 # int | The ID of the load effect to retrieve.
    is_percentage = True # bool | Optional flag indicating whether to return percentage-based load effects. (optional)

    try:
        # Gets load impulses from the specified load effect.
        api_response = api_client.loadeffect.get_load_effect(project_id, connection_id, load_effect_id, is_percentage=is_percentage)
        print("The response of LoadEffectApi->get_load_effect:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling LoadEffectApi->get_load_effect: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/5/projects/{projectId}/connections/{connectionId}/load-effects/{loadEffectId}

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="get_load_effects"></a>
# **get_load_effects**
> List[ConLoadEffect] get_load_effects(project_id, connection_id, is_percentage=is_percentage)

Gets all load effects defined in the specified connection.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project. |
 **connection_id** | **int**| The ID of the connection. |
 **is_percentage** | **bool**| Optional flag indicating whether to return percentage-based load effects. | [optional]

### Return type

[**List[ConLoadEffect]**](ConLoadEffect.md)

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.models.con_load_effect import ConLoadEffect
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def get_load_effectsExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project.
    connection_id = 56 # int | The ID of the connection.
    is_percentage = True # bool | Optional flag indicating whether to return percentage-based load effects. (optional)

    try:
        # Gets all load effects defined in the specified connection.
        api_response = api_client.loadeffect.get_load_effects(project_id, connection_id, is_percentage=is_percentage)
        print("The response of LoadEffectApi->get_load_effects:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling LoadEffectApi->get_load_effects: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/5/projects/{projectId}/connections/{connectionId}/load-effects

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="get_load_settings"></a>
# **get_load_settings**
> ConLoadSettings get_load_settings(project_id, connection_id)

Get Load settings for connection in project.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project. |
 **connection_id** | **int**| The ID of the connection. |

### Return type

**ConLoadSettings**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.models.con_load_settings import ConLoadSettings
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def get_load_settingsExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project.
    connection_id = 56 # int | The ID of the connection.

    try:
        # Get Load settings for connection in project.
        api_response = api_client.loadeffect.get_load_settings(project_id, connection_id)
        print("The response of LoadEffectApi->get_load_settings:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling LoadEffectApi->get_load_settings: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/5/projects/{projectId}/connections/{connectionId}/load-effects/get-load-settings

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="set_load_settings"></a>
# **set_load_settings**
> ConLoadSettings set_load_settings(project_id, connection_id, con_load_settings=con_load_settings)

Set Load settings for connection in project.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project. |
 **connection_id** | **int**| The ID of the connection. |
 **con_load_settings** | **ConLoadSettings**| The new load settings to apply. | [optional]

### Return type

**ConLoadSettings**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.models.con_load_settings import ConLoadSettings
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def set_load_settingsExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project.
    connection_id = 56 # int | The ID of the connection.
    con_load_settings = ideastatica_connection_api.ConLoadSettings() # ConLoadSettings | The new load settings to apply. (optional)

    try:
        # Set Load settings for connection in project.
        api_response = api_client.loadeffect.set_load_settings(project_id, connection_id, con_load_settings=con_load_settings)
        print("The response of LoadEffectApi->set_load_settings:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling LoadEffectApi->set_load_settings: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **POST** /api/5/projects/{projectId}/connections/{connectionId}/load-effects/set-load-settings

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: application/json
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**422** | Unprocessable Content |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)

<a id="update_load_effect"></a>
# **update_load_effect**
> ConLoadEffect update_load_effect(project_id, connection_id, con_load_effect=con_load_effect)

Update load impulses in conLoading.

### Parameters

Name | Type | Description  | Notes
------------- | ------------- | ------------- | -------------
 **project_id** | **str**| The unique identifier of the opened project. |
 **connection_id** | **int**| The ID of the connection. |
 **con_load_effect** | **ConLoadEffect**| The load effect data to update. | [optional]

### Return type

**ConLoadEffect**

### Example

Required Imports
```python
import ideastatica_connection_api
from ideastatica_connection_api.models.con_load_effect import ConLoadEffect
from ideastatica_connection_api.rest import ApiException
from pprint import pprint

```

For client instantiation instructions, refer to the [[README]](../README.md) documentation.

```python
def update_load_effectExampleFunc(api_client):

    project_id = 'project_id_example' # str | The unique identifier of the opened project.
    connection_id = 56 # int | The ID of the connection.
    con_load_effect = ideastatica_connection_api.ConLoadEffect() # ConLoadEffect | The load effect data to update. (optional)

    try:
        # Update load impulses in conLoading.
        api_response = api_client.loadeffect.update_load_effect(project_id, connection_id, con_load_effect=con_load_effect)
        print("The response of LoadEffectApi->update_load_effect:\n")
        pprint(api_response)
        return api_response
    except Exception as e:
        print("Exception when calling LoadEffectApi->update_load_effect: %s\n" % e)
```

### Code Samples

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **PUT** /api/5/projects/{projectId}/connections/{connectionId}/load-effects

### Authorization

No authorization required

### HTTP request headers

 - **Content-Type**: application/json
 - **Accept**: application/json

### HTTP response details

| Status code | Description | Response headers |
|-------------|-------------|------------------|
**200** | OK |  -  |
**401** | Unauthorized |  -  |
**404** | Not Found |  -  |
**422** | Unprocessable Content |  -  |
**500** | Internal Server Error |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)